from typing import Dict
from typing import List


def test_filter_by_currency (list|dict)
'''
Функция filter_by_currency принимает список словарей на вход
и возвращает итератор, который поочередно выдает транзакции, 
где валюта операции соответствует заданной (например, USD)
'''
    pass


def test_transaction_descriptions (list|dict)
'''
Функция-генератор transaction_descriptions
принимает на вход список словарей и использует 
yield для генерации значений по запросу.
'''
    pass


def test_card_number_generator (start, stop)
'''
Генератор card_number_generator принимает значения 
start и stop в качестве аргумента
'''
    pass



'''    
Примеры тест-кейсов/ Тестирование функции: filter_by_currency:
- Напишите тесты, проверяющие, что функция корректно фильтрует транзакции по заданной валюте.
- Проверьте, что функция правильно обрабатывает случаи, когда транзакции в заданной валюте отсутствуют.
- Убедитесь, что генератор не завершается ошибкой при обработке пустого списка или списка без соответствующих валютных операций.

Примеры тест-кейсов/ Тестирование функции: transaction_descriptions:
- Проверьте, что функция возвращает корректные описания для каждой транзакции.
- Тестируйте работу функции с различным количеством входных транзакций, включая пустой список.

Примеры тест-кейсов/ Тестирование генератора: card_number_generator:
- Напишите тесты, которые проверяют, что генератор выдает правильные номера карт в заданном диапазоне.
- Проверьте корректность форматирования номеров карт.
- Убедитесь, что генератор корректно обрабатывает крайние значения диапазона и правильно завершает генерацию.
'''