def get_mask_card_number(number: str) -> str:
    """Функция get_mask_card_number принимает на вход номер карты и возвращает ее маску.
    Номер карты замаскирован и отображается в формате XXXX XX** **** XXXX , где X  — это цифра номера.
    То есть видны первые 6 цифр и последние 4 цифры, остальные символы отображаются звездочками,
    номер разбит по блокам по 4 цифры, разделенным пробелами. Пример работы функции:
    7000792289606361 - входной аргумент, 7000 79** **** 6361 - выход функции"""

    # number = input('Введите номер карты из 16 цифр: например 7000792289606364: ///  ')
    number_1 = ""
    number_2 = ""

    for i, num in enumerate(number):
        if i in [
            0,
            1,
            2,
            3,
            4,
            5,
            len(number) - 4,
            len(number) - 3,
            len(number) - 2,
            len(number) - 1,
            len(number) - 4,
        ]:
            number_1 += num
        else:
            number_1 += "*"
    # print (number_1)

    for i_1 in range(0, len(number_1), 4):
        number_2 += number_1[i_1 : i_1 + 4] + " "
    # print("Маска номера карты: ", end="")
    return number_2[:-1]


def get_mask_account(number: str) -> str:
    """Функция get_mask_account принимает на вход номер счета и возвращает его маску.
    Номер счета замаскирован и отображается в формате **XXXX , где X — это цифра номера.
    То есть видны только последние 4 цифры номера, а перед ними — две звездочки. Пример работы функции:
    73654108430135874305  # входной аргумент, **4305  # выход функции"""

    mask_account = f"**{number[-4:]}"
    # print("Маска номера счета: ", end="")
    return mask_account


# Вызов функций:
if __name__ == "__main__":
    print(get_mask_card_number(input("Введите номер карты из 16 цифр: например 7000792289606364: ///  ")))
    print(get_mask_account(input("Введите номер account: например 736541084301358743054: ///   ")))
