def get_mask_card_number(number: str) -> str:
    """Функция get_mask_card_number принимает на вход номер карты и возвращает ее маску.
    Номер карты замаскирован и отображается в формате XXXX XX** **** XXXX , где X  — это цифра номера.
    То есть видны первые 6 цифр и последние 4 цифры, остальные символы отображаются звездочками,
    номер разбит по блокам по 4 цифры, разделенным пробелами. Пример работы функции:
    7000792289606361 - входной аргумент, 7000 79** **** 6361 - выход функции"""

    # number = input('Введите номер карты из 16 цифр: например 7000792289606364: ///  ')
    number = number.replace(" ", "")

    if number == "":
        return "Ошибка: Вы не ввели номер карты"
    if not number.isdigit():
        return "Ошибка: номер карты должен состоять только из цифр"
    if len(number) != 16:
        return "Ошибка: неверная длина номера"

    mask = f"{number[:4]} {number[4:6]}** **** {number[-4:]}"
    return mask


def get_mask_account(number: str) -> str:
    """Функция get_mask_account принимает на вход номер счета и возвращает его маску.
    Номер счета замаскирован и отображается в формате **XXXX , где X — это цифра номера.
    То есть видны только последние 4 цифры номера, а перед ними — две звездочки. Пример работы функции:
    73654108430135874305  # входной аргумент, **4305  # выход функции"""

    number = number.replace(" ", "")

    if number == "":
        raise ValueError("Ошибка: Вы не ввели номер счета")
    if not number.isdigit():
        raise ValueError("Ошибка: номер счета должен состоять только из цифр")
    if len(number) != 20:
        raise ValueError("Ошибка: неверная длина номера")

    mask_account = f"**{number[-4:]}"
    return mask_account


# Вызов функций: закомменчено, т.к. снижает % покрытия тестами
if __name__ == "__main__":
    print(get_mask_card_number(input("Введите номер карты из 16 цифр: например 7000792289606364: ///  ")))
    print(get_mask_account(input("Введите номер account: например 736541084301358743054: ///   ")))
